In [199]:
import pandas as pd
import numpy as np

In [200]:
#Carga de Datasets
amazon_titles_df = pd.read_csv('Datasets/amazon_prime_titles.csv',skipinitialspace = True)
amazon_titles_df_copy = pd.read_csv('Datasets/amazon_prime_titles.csv',skipinitialspace = True)

disney_plus_titles = pd.read_csv('Datasets/disney_plus_titles.csv')
disney_plus_titles_copy = pd.read_csv('Datasets/disney_plus_titles.csv')

hulu_titles = pd.read_csv('Datasets/hulu_titles.csv')
hulu_titles_copy = pd.read_csv('Datasets/hulu_titles.csv')

netflix_titles = pd.read_json('Datasets/netflix_titles.json')
netflix_titles_copy = pd.read_json('Datasets/netflix_titles.json')

In [201]:
#Limpieza de del Dataset de titulos de Amazon

print(amazon_titles_df.isna().sum()) #Cantidad de nulos por columna
print('')
print('Longitud Dataframe: ',len(amazon_titles_df))

show_id            0
type               0
title              0
director        2082
cast            1233
country         8996
date_added      9513
release_year       0
rating           337
duration           0
listed_in          0
description        0
dtype: int64

Longitud Dataframe:  9668

In [202]:
#Se quita el caracter 's' de la columna id, dejando solo números.

amazon_titles_df['show_id'] = amazon_titles_df['show_id'].apply(lambda x: x.split('s')[1])

In [203]:
#Vemos cuales son los valores que pueden llegar a aparecer en la columna 'type'

amazon_titles_df.type.value_counts()

Movie      7814
TV Show    1854
Name: type, dtype: int64

In [204]:
amazon_titles_df.title = amazon_titles_df.title.str.title()

In [205]:
#Creacion de una tabla con todos los directores y su respectivo ID

amazon_titles_df.director.fillna('Sin Dato', inplace=True)

directors_amazon = []

for directors in amazon_titles_df.director:
    directors_split = directors.split(',')
    for splited_directors in directors_split:
        directors_amazon.append(splited_directors)

all_directors_amazon = pd.Series(directors_amazon)
all_directors_amazon= pd.unique(all_directors_amazon)
all_directors_amazon_df = pd.DataFrame({'IdDirector': np.arange(len(all_directors_amazon)), 'Director Name': all_directors_amazon})
all_directors_amazon_df.set_index('IdDirector',inplace=True)
all_directors_amazon_df

                 Director Name
IdDirector
0                 Don McKellar
1                 Girish Joshi
2                  Josh Webber
3               Sonia Anderson
4                 Giles Foster
...                        ...
6272           Lori Silverbush
6273        John-Paul Davidson
6274           Stephen Warbeck
6275                Emily Skye
6276              Steve Barker

[6277 rows x 1 columns]

In [206]:
#Creacion de una tabla con todos los actores y su respectivo ID

amazon_titles_df.cast = amazon_titles_df.cast.str.strip()
amazon_titles_df.cast = amazon_titles_df.cast.str.title()
amazon_titles_df.cast = amazon_titles_df.cast.replace(np.nan,'Sin Dato')

all_cast_amazon = []

for cast in amazon_titles_df.cast:
    splited_cast = cast.split(',')
    for complete_cast in splited_cast:
        all_cast_amazon.append(complete_cast)

all_cast_amazon = pd.Series(all_cast_amazon)
all_cast_amazon = pd.unique(all_cast_amazon)
all_cast_amazon_df = pd.DataFrame({'IdActor': np.arange(len(all_cast_amazon)), 'Actor Name': all_cast_amazon})
all_cast_amazon_df.set_index('IdActor', inplace=True)
all_cast_amazon_df

                   Actor Name
IdActor
0             Brendan Gleeson
1               Taylor Kitsch
2              Gordon Pinsent
3            Mahesh Manjrekar
4               Abhay Mahajan
...                       ...
33825            Rita Cortese
33826          Laura Esquivel
33827         Nicolás Furtado
33828     Nicolas Goldschmidt
33829           Joseph Gilgun

[33830 rows x 1 columns]

In [207]:
#Se llenan los valores faltantes con la palabra 'sin dato' y posteriormente se crea una tabla con los distintos países que aparecen en el Dataframe de películas/series de Amazon


amazon_titles_df.country = amazon_titles_df.country.fillna('Sin Dato')

all_amazon_countrys = []

for country in amazon_titles_df.country:
    splited_country = country.split(',')
    for country_spliter in splited_country:
        all_amazon_countrys.append(country_spliter.strip())

all_amazon_countrys = pd.Series(all_amazon_countrys)
all_amazon_countrys = pd.unique(all_amazon_countrys)
all_amazon_countrys_df = pd.DataFrame({'IdCountry': np.arange(len(all_amazon_countrys)), 'Country Name': all_amazon_countrys})
all_amazon_countrys_df.set_index('IdCountry', inplace=True)
all_amazon_countrys_df

                   Country Name
IdCountry
0                        Canada
1                         India
2                 United States
3                United Kingdom
4                        France
5                         Spain
6                      Sin Dato
7                         Italy
8                       Germany
9                         Japan
10                        China
11                      Denmark
12               Czech Republic
13                  Netherlands
14                      Ireland
15                     Thailand
16                       Brazil
17                  Switzerland
18                    Australia
19                      Belgium
20                        Chile
21                    Argentina
22                       Mexico
23                       Sweden
24                  New Zealand
25                     Portugal
26                      Hungary
27                         Iran
28                   Luxembourg
29                 South Africa
30                      Austria
31                       Monaco
32                        Egypt
33         United Arab Emirates
34                    Singapore
35                  South Korea
36                  Afghanistan
37                     Colombia
38                       Norway
39                       Kosovo
40                   Kazakhstan
41                     Malaysia
42                       Poland
43                      Albania
44                      Georgia
45                    Hong Kong

In [208]:
#Cambio de tipo de la columna a datetime

amazon_titles_df['date_added'] = pd.to_datetime(amazon_titles_df['date_added'])
amazon_titles_df['date_added']

0      2021-03-30
1      2021-03-30
2      2021-03-30
3      2021-03-30
4      2021-03-30
          ...
9663          NaT
9664          NaT
9665          NaT
9666          NaT
9667          NaT
Name: date_added, Length: 9668, dtype: datetime64[ns]

In [209]:
#Creacion de columna de generos de cine con sus respectivos ID

all_listed_in_amazon = []

for genre in amazon_titles_df.listed_in:
    separed_genre = genre.split(',')
    for all_genres_separed in separed_genre:
        all_listed_in_amazon.append(all_genres_separed)

all_listed_in_amazon_serie = pd.Series(all_listed_in_amazon)
all_listed_in_amazon_serie = pd.unique(all_listed_in_amazon_serie)
all_listed_in_df = pd.DataFrame({'IdGenre': np.arange(len(all_listed_in_amazon_serie)), 'Genre': all_listed_in_amazon_serie})
all_listed_in_df['Genre'] = all_listed_in_df['Genre'].str.strip()
all_listed_in_df.drop_duplicates(subset=['Genre'], inplace=True)
all_listed_in_df.IdGenre = np.arange(len(all_listed_in_df))
all_listed_in_df.set_index('IdGenre', inplace=True)
all_listed_in_df

                             Genre
IdGenre
0                           Comedy
1                            Drama
2                    International
3                           Action
4                         Suspense
5                      Documentary
6                          Fantasy
7                             Kids
8                 Special Interest
9                  Science Fiction
10                       Adventure
11                          Horror
12                          Sports
13           Talk Show and Variety
14                           Anime
15                            Arts
16                   Entertainment
17                     and Culture
18                        TV Shows
19                       Animation
20       Music Videos and Concerts
21                         Fitness
22          Faith and Spirituality
23                Military and War
24                         Western
25                           LGBTQ
26                         Romance
27                      Unscripted
28            Young Adult Audience
29                        Arthouse
30                      Historical

In [210]:
#Total de nulos después de la limpieza de datos de el primer .csv

amazon_titles_df.isna().sum()

show_id            0
type               0
title              0
director           0
cast               0
country            0
date_added      9513
release_year       0
rating           337
duration           0
listed_in          0
description        0
dtype: int64

In [211]:
amazon_titles_df['platform'] = 'Amazon Prime'
amazon_titles_df

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description,platform
0,1,Movie,The Grand Seduction,Don McKellar,"Brendan Gleeson, Taylor Kitsch, Gordon Pinsent",Canada,2021-03-30,2014,NaN,113 min,"Comedy, Drama",A small fishing village must procure a local d...,Amazon Prime
1,2,Movie,Take Care Good Night,Girish Joshi,"Mahesh Manjrekar, Abhay Mahajan, Sachin Khedekar",India,2021-03-30,2018,13+,110 min,"Drama, International",A Metro Family decides to fight a Cyber Crimin...,Amazon Prime
2,3,Movie,Secrets Of Deception,Josh Webber,"Tom Sizemore, Lorenzo Lamas, Robert Lasardo, R...",United States,2021-03-30,2017,NaN,74 min,"Action, Drama, Suspense",After a man discovers his wife is cheating on ...,Amazon Prime
3,4,Movie,Pink: Staying True,Sonia Anderson,"Interviews With: Pink, Adele, Beyoncé, Britney...",United States,2021-03-30,2014,NaN,69 min,Documentary,"Pink breaks the mold once again, bringing her ...",Amazon Prime
4,5,Movie,Monster Maker,Giles Foster,"Harry Dean Stanton, Kieran O'Brien, George Cos...",United Kingdom,2021-03-30,1989,NaN,45 min,"Drama, Fantasy",Teenage Matt Banting wants to work with a famo...,Amazon Prime
...,...,...,...,...,...,...,...,...,...,...,...,...,...
9663,9664,Movie,Pride Of The Bowery,Joseph H. Lewis,"Leo Gorcey, Bobby Jordan",Sin Dato,NaT,1940,7+,60 min,Comedy,New York City street principles get an East Si...,Amazon Prime
9664,9665,TV Show,Planet Patrol,Sin Dato,"Dick Vosburgh, Ronnie Stevens, Libby Morris, M...",Sin Dato,NaT,2018,13+,4 Seasons,TV Shows,"This is Earth, 2100AD - and these are the adve...",Amazon Prime
9665,9666,Movie,Outpost,Steve Barker,"Ray Stevenson, Julian Wadham, Richard Brake, M...",Sin Dato,NaT,2008,R,90 min,Action,"In war-torn Eastern Europe, a world-weary grou...",Amazon Prime
9666,9667,TV Show,Maradona: Blessed Dream,Sin Dato,"Esteban Recagno, Ezequiel Stremiz, Luciano Vit...",Sin Dato,NaT,2021,TV-MA,1 Season,"Drama, Sports","The series tells the story of Diego Maradona, ...",Amazon Prime
9667,9668,Movie,Harry Brown,Daniel Barber,"Michael Caine, Emily Mortimer, Joseph Gilgun, ...",Sin Dato,NaT,2010,R,103 min,"Action, Drama, Suspense","Harry Brown, starring two-time Academy Award w...",Amazon Prime

In [212]:
#Comienzo a trabajar con el dataset de Disney+ viendo la cantidad de nulos que posee cada columna

disney_plus_titles.isna().sum()

show_id           0
type              0
title             0
director        473
cast            190
country         219
date_added        3
release_year      0
rating            3
duration          0
listed_in         0
description       0
dtype: int64

In [213]:
#Se limpia la columna show_id quitandole la 's' a los números

disney_plus_titles.show_id = np.arange(1,(len(disney_plus_titles)+1))

In [214]:
#Distribución de la columna 'type'

disney_plus_titles.type.value_counts()

Movie      1052
TV Show     398
Name: type, dtype: int64

In [215]:
#Se quitan los espacios de la columna title

disney_plus_titles.title = disney_plus_titles.title.str.strip()

In [216]:
#Se crea una tabla con los distintos directores que aparecieron en el dataframe de películas/series en Disney+

disney_plus_titles.director = disney_plus_titles.director.str.strip()
disney_plus_titles.director = disney_plus_titles.director.fillna('Sin Dato')

strip_directors_disney = []

for director in disney_plus_titles.director:
    strip_director = director.split(',')
    for striped_director in strip_director:
        strip_directors_disney.append(striped_director.strip())

strip_directors_disney = pd.Series(strip_directors_disney)
strip_directors_disney = pd.unique(strip_directors_disney)
strip_directors_disney_df = pd.DataFrame({'IdDirector': np.arange(len(strip_directors_disney)), 'Director': strip_directors_disney})
strip_directors_disney_df.set_index('IdDirector', inplace=True)
strip_directors_disney_df

                             Director
IdDirector
0                Alonso Ramirez Ramos
1                         Dave Wasson
2                         John Cherry
3                        Karen Disher
4                     Hamish Hamilton
...                               ...
631         Elizabeth Allen Rosenbaum
632                        Gavin Hood
633                   Dexter Fletcher
634                   Gurinder Chadha
635                       Mark Waring

[636 rows x 1 columns]

In [217]:
#Se quitan los espacios en blanco, se llenan los valores vacíos con la frase 'Sin Dato' y se crea una tabla con los distintos actores en la plataforma Disney+

disney_plus_titles.cast = disney_plus_titles.cast.str.strip()
disney_plus_titles.cast = disney_plus_titles.cast.fillna('Sin Dato')

all_disney_cast = []

for disney_cast in disney_plus_titles.cast:
    splited_disney_cast = disney_cast.split(',')
    for splited_disney in splited_disney_cast:
        all_disney_cast.append(splited_disney.strip())
        
all_disney_cast = pd.Series(all_disney_cast)
all_disney_cast = pd.unique(all_disney_cast)
all_disney_cast_df = pd.DataFrame({'IdActor': np.arange(len(all_disney_cast)), 'Actor Name': all_disney_cast})
all_disney_cast_df.set_index('IdActor', inplace=True)
all_disney_cast_df

                   Actor Name
IdActor
0        Chris Diamantopoulos
1                Tony Anselmo
2             Tress MacNeille
3                 Bill Farmer
4                Russi Taylor
...                       ...
3750          Parminder Nagra
3751     Jonathan Rhys-Meyers
3752              Anupam Kher
3753           Archie Panjabi
3754            Shaznay Lewis

[3755 rows x 1 columns]

In [218]:
#Se crea una tabla de 'country' para el dataframe de Disney+, con los distintos países

disney_plus_titles.country = disney_plus_titles.country.fillna('Sin Dato')

all_disney_countrys = []

for country in disney_plus_titles.country:
    splited_countrys = country.split(',')
    for clean_country in splited_countrys:
        all_disney_countrys.append(clean_country.strip())

all_disney_countrys = pd.Series(all_disney_countrys)
all_disney_countrys = pd.unique(all_disney_countrys)
all_disney_countrys_df = pd.DataFrame({'IdCountry': np.arange(len(all_disney_countrys)), 'Country Name': all_disney_countrys})
all_disney_countrys_df.set_index('IdCountry', inplace=True)
all_disney_countrys_df

                   Country Name
IdCountry
0                      Sin Dato
1                 United States
2                        Canada
3                     Australia
4                United Kingdom
5                   South Korea
6                       Ireland
7                       Denmark
8                         Spain
9                        Poland
10                      Hungary
11                       France
12                        Japan
13                      Germany
14                        India
15                    Singapore
16                     Thailand
17                        China
18                       Brazil
19                      Belgium
20                      Austria
21                 South Africa
22                    Hong Kong
23                    Argentina
24         United Arab Emirates
25                       Mexico
26                  Switzerland
27                       Taiwan
28                  Philippines
29                     Tanzania
30                       Panama
31                       Angola
32                     Botswana
33                      Namibia
34                   Luxembourg
35                    Guatemala
36                       Russia
37                     Malaysia
38                   Kazakhstan
39                        Syria
40                         Iran
41                        Egypt
42                     Pakistan
43                  New Zealand
44                       Norway
45                       Sweden
46                     Slovenia
47               Czech Republic

In [219]:
#Se cambia el formato de la columna 'date_added' a datetime

disney_plus_titles.date_added = pd.to_datetime(disney_plus_titles.date_added)
disney_plus_titles.date_added

0      2021-11-26
1      2021-11-26
2      2021-11-26
3      2021-11-26
4      2021-11-25
          ...
1445   2021-06-04
1446   2021-04-02
1447   2020-12-18
1448   2020-09-18
1449   2020-04-01
Name: date_added, Length: 1450, dtype: datetime64[ns]

In [220]:
#Nos damos cuenta de que la columna release_year no tiene ningún valor faltante

disney_plus_titles.release_year.isna().sum()

0

In [221]:
#Se cambia el año de salida de la película/serie en cuestión a string

disney_plus_titles.release_year = disney_plus_titles.release_year.astype(str)
disney_plus_titles.dtypes

show_id                  int32
type                    object
title                   object
director                object
cast                    object
country                 object
date_added      datetime64[ns]
release_year            object
rating                  object
duration                object
listed_in               object
description             object
dtype: object

In [222]:
#Se quitan los espacios y se crea una tabla con los distintos géneros de películas y series en Disney+

disney_plus_titles.listed_in = disney_plus_titles.listed_in.str.strip()

all_listed_in_disney = []

for listed in disney_plus_titles.listed_in:
    splited_listed_disney = listed.split(',')
    for all_listed in splited_listed_disney:
        all_listed_in_disney.append(all_listed.strip())

all_listed_in_disney = pd.Series(all_listed_in_disney)
all_listed_in_disney = pd.unique(all_listed_in_disney)
all_listed_in_disney_df = pd.DataFrame({'IdGenre': np.arange(len(all_listed_in_disney)), 'Genre': all_listed_in_disney})
all_listed_in_disney_df.set_index('IdGenre', inplace=True)
all_listed_in_disney_df

                           Genre
IdGenre
0                      Animation
1                         Family
2                         Comedy
3                        Musical
4                     Docuseries
5                     Historical
6                          Music
7                   Biographical
8                    Documentary
9               Action-Adventure
10                     Superhero
11                       Reality
12                      Survival
13              Animals & Nature
14                          Kids
15                 Coming of Age
16                         Drama
17                       Fantasy
18                     Lifestyle
19                        Movies
20               Science Fiction
21                  Concert Film
22                         Crime
23                        Sports
24                     Anthology
25                       Medical
26                       Variety
27                 Spy/Espionage
28                         Buddy
29                        Parody
30       Game Show / Competition
31                       Romance
32                         Anime
33               Romantic Comedy
34                      Thriller
35                    Police/Cop
36                     Talk Show
37                       Western
38                         Dance
39                        Series
40                       Mystery
41        Soap Opera / Melodrama
42                      Disaster
43                        Travel

In [223]:
#Se agrega una columna 'plataform' para saber a que dataframe corresponde la información 

disney_plus_titles['platform'] = 'Disney+'
disney_plus_titles['platform']

0       Disney+
1       Disney+
2       Disney+
3       Disney+
4       Disney+
         ...
1445    Disney+
1446    Disney+
1447    Disney+
1448    Disney+
1449    Disney+
Name: platform, Length: 1450, dtype: object

In [224]:
#Comienzo a trabajar con el dataframe de Hulu viendo la cantidad de nulos que poseen las columnas

print(hulu_titles.isna().sum())
print('')
print('Longitud del Dataframe:', len(hulu_titles))

show_id            0
type               0
title              0
director        3070
cast            3073
country         1453
date_added        28
release_year       0
rating           520
duration         479
listed_in          0
description        4
dtype: int64

Longitud del Dataframe: 3073

In [225]:
#Longitud del dataframe de hulu

len(hulu_titles)

3073

In [226]:
#Se quitan las 's' de la columna 'show_id'

hulu_titles.show_id = np.arange(1,(3074))
hulu_titles.show_id

0          1
1          2
2          3
3          4
4          5
        ...
3068    3069
3069    3070
3070    3071
3071    3072
3072    3073
Name: show_id, Length: 3073, dtype: int32

In [227]:
#Distribución de la columna 'type'

hulu_titles.type.value_counts()

TV Show    1589
Movie      1484
Name: type, dtype: int64

In [228]:
#Se capitaliza la columna titles de la columna 'title'

hulu_titles.title = hulu_titles.title.str.title()
hulu_titles.title

0       Ricky Velez: Here'S Everything
1                         Silent Night
2                         The Marksman
3                                 Gaia
4                             Settlers
                     ...
3068    Star Trek: The Original Series
3069                Star Trek: Voyager
3070                         The Fades
3071                 The Twilight Zone
3072               Tokyo Magnitude 8.0
Name: title, Length: 3073, dtype: object

In [229]:
#Nos damos cuenta de que hay solo 3 valores que no son faltantes en la columna 'director', y los valores estan sin limpieza

hulu_titles.director = hulu_titles.director.fillna('Sin Dato')
hulu_titles.director.value_counts()

Sin Dato                                                                                                                                                                      3070
Director Jennifer Kent ("The Babadook") tells the sweeping tale of a young woman's quest for revenge set in 1825 against the perilous and unforgiving terrain of Tasmania.       1
Director Gigi Saul Guerrero talks through Culture Shock’s themes – immigration, filmmaking, and latinidad – in this one-on-one chat.                                             1
Director Alex Winter goes inside the biggest global corruption scandal in history that was uncovered by hundreds of journalists, working in secret and at enormous risk.         1
Name: director, dtype: int64

In [230]:
#Se buscan los datos de los directores sin limpieza y se normalizan, despues se reemplazan los valores sin normalizar por lo que ya lo estan y se sacan los espacios innecesarios

all_directors_hulu = []

for director in hulu_titles.director:
    if director == 'Sin Dato':
        continue
    else:
        all_directors_hulu.append(director[8:27])

all_directors_hulu[0] = 'Jennifer Kent'
all_directors_hulu[2] = 'Alex Winter'

hulu_titles.director = hulu_titles.director.replace("""Director Jennifer Kent ("The Babadook") tells the sweeping tale of a young woman's quest for revenge set in 1825 against the perilous and unforgiving terrain of Tasmania.""", all_directors_hulu[0])

hulu_titles.director = hulu_titles.director.replace("""Director Gigi Saul Guerrero talks through Culture Shock’s themes – immigration, filmmaking, and latinidad – in this one-on-one chat.""", all_directors_hulu[1])

hulu_titles.director = hulu_titles.director.replace("""Director Alex Winter goes inside the biggest global corruption scandal in history that was uncovered by hundreds of journalists, working in secret and at enormous risk.""", all_directors_hulu[2])

hulu_titles.director = hulu_titles.director.str.strip()

hulu_titles.director.value_counts()

Sin Dato              3070
Jennifer Kent            1
Gigi Saul Guerrero       1
Alex Winter              1
Name: director, dtype: int64

In [231]:
#Nos damos cuenta de que 'cast' tiene todos valores faltantes, por lo que por ahora se omite esa columna

hulu_titles.isna().sum()

show_id            0
type               0
title              0
director           0
cast            3073
country         1453
date_added        28
release_year       0
rating           520
duration         479
listed_in          0
description        4
dtype: int64

In [232]:
#Se rellenan los valores faltantes con la frase 'Sin Dato', despues se separan los valores de la columna 'country' y se crea una tabla con los distintos valores.

hulu_titles.country = hulu_titles.country.fillna('Sin Dato')

all_hulu_countrys = []

for country in hulu_titles.country:
    splited_country = country.split(',')
    for clean_country in splited_country:
        all_hulu_countrys.append(clean_country.strip())
    
all_hulu_countrys = pd.Series(all_hulu_countrys)
all_hulu_countrys = pd.unique(all_hulu_countrys)
all_hulu_countrys_df = pd.DataFrame({'IdCountry': np.arange(len(all_hulu_countrys)), 'Country Name': all_hulu_countrys})
all_hulu_countrys_df.set_index('IdCountry', inplace=True)
all_hulu_countrys_df

                   Country Name
IdCountry
0                      Sin Dato
1                 United States
2                         Japan
3                United Kingdom
4                        Mexico
5                       Ireland
6                       Germany
7                        Sweden
8                        Canada
9                        France
10                  New Zealand
11                        Italy
12               Czech Republic
13                        Spain
14                    Australia
15                      Denmark
16                       Israel
17                       Russia
18                 South Africa
19                      Belgium
20                   Luxembourg
21                        China
22                       Poland
23                      Ukraine
24                        Malta
25                        Chile
26                  Netherlands
27         United Arab Emirates
28                       Norway
29                  Philippines
30                      Hungary
31                     Bulgaria
32                  South Korea
33                     Thailand
34                  Switzerland
35                      Tunisia
36                      Romania
37                  Afghanistan
38                       Serbia
39                   Montenegro
40                   Costa Rica
41                    Hong Kong
42                     Colombia
43             French Polynesia
44                 Saudi Arabia
45                      Austria
46                    Argentina
47                      Uruguay
48                        Qatar
49                        Syria
50                    Venezuela
51                      Finland
52                        India
53                    Singapore
54                       Greece
55                      Iceland
56                       Brazil
57                       Taiwan

In [233]:
#Se cambia el tipo de la columna 'date_add' a datetime

hulu_titles.date_added = pd.to_datetime(hulu_titles.date_added)
hulu_titles.date_added

0      2021-10-24
1      2021-10-23
2      2021-10-23
3      2021-10-22
4      2021-10-22
          ...
3068          NaT
3069          NaT
3070          NaT
3071          NaT
3072          NaT
Name: date_added, Length: 3073, dtype: datetime64[ns]

In [236]:
#Nos damos cuenta de que 'release_year', 'rating', 'duration' y 'description' cuentan con valores faltantes, por lo que ahora voy a trabajar con la columna 'listed_in' separando los valores de generos de series/películas y despues combinar los valores unicos de los distintos géneros de tanto Amazon, como Disney+

hulu_titles.isna().sum()

show_id            0
type               0
title              0
director           0
cast            3073
country            0
date_added        28
release_year       0
rating           520
duration         479
listed_in          0
description        4
dtype: int64

In [245]:
all_listed_in_hulu = []

for listed in hulu_titles.listed_in:
    splited_listed_in = listed.split(',')
    for splited_listed_in in splited_listed_in:
        all_listed_in_hulu.append(splited_listed_in.strip())
    
all_listed_in_hulu = pd.Series(all_listed_in_hulu)
all_listed_in_hulu = pd.unique(all_listed_in_hulu)
all_listed_in_hulu_df = pd.DataFrame({'IdGenre': np.arange(len(all_listed_in_hulu)), 'Genre': all_listed_in_hulu})
all_listed_in_hulu_df.set_index('IdGenre', inplace=True)
all_listed_in_hulu_df

                        Genre
IdGenre
0                      Comedy
1                    Stand Up
2                       Crime
3                       Drama
4                    Thriller
5                      Action
6                      Horror
7             Science Fiction
8                      Family
9                        Kids
10             Cooking & Food
11              Documentaries
12        Lifestyle & Culture
13                      Music
14                    Reality
15                    Romance
16                       News
17                    Mystery
18                     Sports
19                    History
20                       Teen
21          Health & Wellness
22              Black Stories
23                     Latino
24                  Adventure
25                      Anime
26                 Late Night
27              Sketch Comedy
28                   Classics
29                     LGBTQ+
30            Adult Animation
31                     Sitcom
32              International
33                 Game Shows
34                   Cartoons
35       Science & Technology

In [247]:
#Se termina el ETL preliminar de el dataframe de Hulu y se comienza con el de Netflix, viendo sus valores faltantes por columna

netflix_titles.isna().sum()

show_id            0
type               0
title              0
director        2634
cast             825
country          831
date_added        10
release_year       0
rating             4
duration           3
listed_in          0
description        0
dtype: int64

In [251]:
#Se quitan las 's' de la columna 'show_id' dejando solo números

netflix_titles.show_id = np.arange(1,(len(netflix_titles.show_id)+1))
netflix_titles.show_id

0          1
1          2
2          3
3          4
4          5
        ...
8802    8803
8803    8804
8804    8805
8805    8806
8806    8807
Name: show_id, Length: 8807, dtype: int32

In [254]:
#Distribución de la columa 'type'

netflix_titles.type.value_counts()

Movie      6131
TV Show    2676
Name: type, dtype: int64

In [261]:
#Se quitan los espacios y se capitaliza la columna 'title'

netflix_titles.title = netflix_titles.title.str.strip()
netflix_titles.title = netflix_titles.title.str.title()
netflix_titles.title

0        Dick Johnson Is Dead
1               Blood & Water
2                   Ganglands
3       Jailbirds New Orleans
4                Kota Factory
                ...
8802                   Zodiac
8803              Zombie Dumb
8804               Zombieland
8805                     Zoom
8806                   Zubaan
Name: title, Length: 8807, dtype: object

In [270]:
#El dataframe, en sus valores faltantes, contiene None en vez de NaN, por lo que los cambio por NaN

netflix_titles.replace(to_replace=[None], value=np.nan, inplace=True)
netflix_titles

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description
0,1,Movie,Dick Johnson Is Dead,Kirsten Johnson,NaN,United States,"September 25, 2021",2020,PG-13,90 min,Documentaries,"As her father nears the end of his life, filmm..."
1,2,TV Show,Blood & Water,NaN,"Ama Qamata, Khosi Ngema, Gail Mabalane, Thaban...",South Africa,"September 24, 2021",2021,TV-MA,2 Seasons,"International TV Shows, TV Dramas, TV Mysteries","After crossing paths at a party, a Cape Town t..."
2,3,TV Show,Ganglands,Julien Leclercq,"Sami Bouajila, Tracy Gotoas, Samuel Jouy, Nabi...",NaN,"September 24, 2021",2021,TV-MA,1 Season,"Crime TV Shows, International TV Shows, TV Act...",To protect his family from a powerful drug lor...
3,4,TV Show,Jailbirds New Orleans,NaN,NaN,NaN,"September 24, 2021",2021,TV-MA,1 Season,"Docuseries, Reality TV","Feuds, flirtations and toilet talk go down amo..."
4,5,TV Show,Kota Factory,NaN,"Mayur More, Jitendra Kumar, Ranjan Raj, Alam K...",India,"September 24, 2021",2021,TV-MA,2 Seasons,"International TV Shows, Romantic TV Shows, TV ...",In a city of coaching centers known to train I...
...,...,...,...,...,...,...,...,...,...,...,...,...
8802,8803,Movie,Zodiac,David Fincher,"Mark Ruffalo, Jake Gyllenhaal, Robert Downey J...",United States,"November 20, 2019",2007,R,158 min,"Cult Movies, Dramas, Thrillers","A political cartoonist, a crime reporter and a..."
8803,8804,TV Show,Zombie Dumb,NaN,NaN,NaN,"July 1, 2019",2018,TV-Y7,2 Seasons,"Kids' TV, Korean TV Shows, TV Comedies","While living alone in a spooky town, a young g..."
8804,8805,Movie,Zombieland,Ruben Fleischer,"Jesse Eisenberg, Woody Harrelson, Emma Stone, ...",United States,"November 1, 2019",2009,R,88 min,"Comedies, Horror Movies",Looking to survive in a world taken over by zo...
8805,8806,Movie,Zoom,Peter Hewitt,"Tim Allen, Courteney Cox, Chevy Chase, Kate Ma...",United States,"January 11, 2020",2006,PG,88 min,"Children & Family Movies, Comedies","Dragged from civilian life, a former superhero..."
8806,8807,Movie,Zubaan,Mozez Singh,"Vicky Kaushal, Sarah-Jane Dias, Raaghav Chanan...",India,"March 2, 2019",2015,TV-14,111 min,"Dramas, International Movies, Music & Musicals",A scrappy but poor boy worms his way into a ty...

In [276]:
#Se rellenan los valores faltantes por la frase 'Sin Dato', se quitan los espacios no deseados y se crea una tabla con los distintos directores que aparecen en el dataframe de series/películas de Netflix

netflix_titles.director.fillna('Sin Dato', inplace=True)

all_directors_netflix = []

for director in netflix_titles.director:
    directors_splited = director.split(',')
    for striped_director in directors_splited:
        all_directors_netflix.append(striped_director.strip())

all_directors_netflix = pd.Series(all_directors_netflix)
all_directors_netflix = pd.unique(all_directors_netflix)
all_directors_netflix_df = pd.DataFrame({'IdDirector':np.arange(len(all_directors_netflix)), 'Director Name':all_directors_netflix})
all_directors_netflix_df.set_index('IdDirector', inplace=True)
all_directors_netflix_df

                      Director Name
IdDirector
0                   Kirsten Johnson
1                          Sin Dato
2                   Julien Leclercq
3                     Mike Flanagan
4                     Robert Cullen
...                             ...
4989                         Mu Chu
4990        Chandra Prakash Dwivedi
4991                Majid Al Ansari
4992                   Peter Hewitt
4993                    Mozez Singh

[4994 rows x 1 columns]